simulation/medium/airfoil/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs
{
    type            forceCoeffs;
    libs            ("libforces.so");
    patches         (airfoil);

    p               p;
    U               U;
    rho             rhoInf;

    pRef            0;
    rhoInf          1;
    
    liftDir         (0 1 0);
    dragDir         (1 0 0);
    CofR            (0.102 0 0);
    pitchAxis       (0 0 1);
    
    magUInf         0.8;
    lRef            0.204;
    Aref            0.083232;
    
    binData
    {
        nBin        20;
        direction   (1 0 0);
        cumulative  yes;
    }
}


// ************************************************************************* //
